In [1]:
import pandas as pd 
names = ['Bob','Jessica','Mary','John','Mel'] 
grades = [76,95,77,78,99]
bsdegrees = [1,1,0,0,1]
msdegrees = [2,1,0,0,0] 
phddegrees = [0,1,0,0,0]

In [2]:
GradeList = zip(names,grades,bsdegrees,msdegrees,phddegrees)
df = pd.DataFrame(data=GradeList,columns=['Names','Grades','bsdegrees','msdegrees','phddegrees'])

In [3]:
df

     Names  Grades  bsdegrees  msdegrees  phddegrees
0      Bob      76          1          2           0
1  Jessica      95          1          1           1
2     Mary      77          0          0           0
3     John      78          0          0           0
4      Mel      99          1          0           0

In [10]:
df.count()

Names         5
Grades        5
bsdegrees     5
msdegrees     5
phddegrees    5
dtype: int64

In [4]:
df.mean()

Grades        85.0
bsdegrees      0.6
msdegrees      0.6
phddegrees     0.2
dtype: float64

In [5]:
df.median()

Grades        78.0
bsdegrees      1.0
msdegrees      0.0
phddegrees     0.0
dtype: float64

In [6]:
df.mode()

     Names  Grades  bsdegrees  msdegrees  phddegrees
0      Bob      76        1.0        0.0         0.0
1  Jessica      77        NaN        NaN         NaN
2     John      78        NaN        NaN         NaN
3     Mary      95        NaN        NaN         NaN
4      Mel      99        NaN        NaN         NaN

In [7]:
df.min()

Names         Bob
Grades         76
bsdegrees       0
msdegrees       0
phddegrees      0
dtype: object

In [8]:
df.max()

Names         Mel
Grades         99
bsdegrees       1
msdegrees       2
phddegrees      1
dtype: object

In [9]:
df.quantile(0.25)

Grades        77.0
bsdegrees      0.0
msdegrees      0.0
phddegrees     0.0
Name: 0.25, dtype: float64

In [11]:
df.quantile(0.5)

Grades        78.0
bsdegrees      1.0
msdegrees      0.0
phddegrees     0.0
Name: 0.5, dtype: float64

In [12]:
df.quantile(0.75)

Grades        95.0
bsdegrees      1.0
msdegrees      1.0
phddegrees     0.0
Name: 0.75, dtype: float64